{
    "APP_NAME": "GS Code Generator",
    "MAKER_MAME": "Carlos J. Ramirez",
    "APP_ICON": ":sparkles:",
    "APP_DESCRIPTION": "allows you to generate code, images, video or answers from a text prompt",
    "CONVERSATION_DB_PATH": "./db/conversations.json",
    "DEFAULT_PAGE": "home",
    "CODE_GENERATION_ENABLED": true,
    "TEXT_GENERATION_ENABLED": true,
    "VIDEO_GENERATION_ENABLED": true,
    "IMAGE_GENERATION_ENABLED": true,
    "CONVERSATION_TITLE_LENGTH": 50,
    "VIDEO_GALLERY_COLUMNS": 3,
    "IMAGE_GALLERY_COLUMNS": 3,
    "DEFAULT_SUGGESTIONS": {
        "s1": "Give me application ideas for a Hackathon about...",
        "s2": "Give me application names for an web application about...",
        "s3": "Give me a README file content for an application about...",
        "s4": "Give me the ReactJs code for a AI Assistant, using Shadcn/UI"
    },
    "DYNAMIC_SUGGESTIONS": true,
    "SUGGESTIONS_PROMPT_TEXT": "I want {question} suggestions for web and mobile application ideas that an be developed in 2-3 day hackathons.\nGive me just a JSON output with the keys s1, s2, s3, etc, and the values for each suggestion.",
    "SUGGESTIONS_QTY": 4,
    "REFINE_VIDEO_PROMPT_TEXT": "Enhance the *USER PROMPT* prompt to make it clear, effective, and suitable for generating a video using a text-to-video AI model.\n    \n    # Steps\n    \n    1. Carefully analyze the initial prompt provided.\n    2. Identify any parts that are unclear or incomplete for generating a video (consider factors like visuals or animation that would be expected for a video format).\n    3. Add specific guidelines to make the video generation output more vivid and engaging. Ensure context for visual scenes or animations is provided if necessary.\n    4. Include a clear sequence that’s appropriate for video content, guiding the AI on how to translate ideas into visuals.\n    5. Ensure the expected output includes direction on storytelling elements, such as scene changes, characters, and any visual effects.\n    \n    # Output Format\n    \n    An enhanced version of the prompt that explicitly:\n    - Adds details for generating video content involving visuals, descriptions, or animations.\n    - Contains a structured flow to depict a coherent visual representation.\n    - Defines scene-by-scene instructions if applicable, to assist in generating video content.\n    \n    # Example\n    \n    **Initial Prompt (Input)**:  \n    \"Explain why a tomato is a fruit, and then list some related fruits.\"\n    \n    **Enhanced Prompt (Output)**:  \n    \"Create a video that explains step-by-step why a tomato is scientifically classified as a fruit. The video should start by depicting a tomato plant, showing its flowers and subsequently its fruit. Add on-screen text explaining its botanical characteristics that belong to fruits, such as having seeds. After emphasizing these characteristics, smoothly transition to displaying other similar fruits, like peppers and cucumbers, with labels for each.\"\n    \n    # Notes:\n    \n    - When enhancing the prompt for video, think visually. Explicitly describe scenes and transitions.\n    - Include directions on how the video content is structured, such as sequence, timing, and visual focus, to guide the AI effectively.\n    - Give me just the enhanced version of the prompt, no other text.\n    \n    *USER PROMPT*\n    {question}",
    "REFINE_LLM_PROMPT_TEXT": "Improve the *USER PROMPT* prompt to make it clearer, more effective, and aligned with the task objectives and expectations.\n    \n    # Steps\n    \n    1. Carefully review the initial prompt provided.\n    2. Identify unclear instructions, missing details, or any ambiguity that could affect the model’s performance.\n    3. Add specific guidelines, necessary context, or well-defined examples if needed.\n    4. Make sure the prompt provides a clear and straightforward reasoning process before concluding the answer. \n    5. Ensure the expected output is explicitly defined, including format, structure, and requirements.\n    6. Avoid unnecessary complexity—focus on simplicity, clarity, and effectiveness.\n    \n    # Output Format\n    \n    An enhanced version of the prompt with:\n    - Clarity in language and expectations\n    - Structured reasoning before conclusions\n    - Defined output format for consistency.\n    \n    # Example\n    \n    **Initial Prompt (Input)**:  \n    \"Explain why a tomato is a fruit, and then list some related fruits.\"\n    \n    **Enhanced Prompt (Output)**:  \n    \"Explain step-by-step why a tomato is scientifically classified as a fruit. Start by describing the botanical characteristics that belong to fruits. After explaining, provide a list of other fruits that share similar characteristics as a tomato, such as being soft and containing seeds.\"\n    \n    ### Notes:\n    - When enhancing the prompt, ensure reasoning precedes any conclusion or answer.\n    - Always define how the output should be structured (e.g., format length or elements).\n    - Give me just the enhanced version of the prompt, no other text.\n    \n    *USER PROMPT*\n    {question}"    
}